benchmark/config/live.example.yaml
# Pinned to the immutable WildJailbreak revision verified on 2026-09-20.
# Access requires accepting the dataset's AI2 Responsible Use Guidelines on Hugging Face
# and authenticating with `hf auth login` (or providing the same credential as HF_TOKEN).
dataset:
  name: allenai/wildjailbreak
  revision: "5ddc12a7894f842b0619b8e1c7ee496b198af009"
  config_name: train
  split: train
task: harmful_jailbreak
sample:
  rate: 0.05
  seed: 20260918
adapters:
  - id: jev
    kind: jev
    model: system-one
  - id: openrouter
    kind: openrouter
    model: openai/gpt-4.1-mini
    parameters:
      temperature: 0
  # Structured-output-capable OpenAI tiers (catalog checked 2026-09-20).
  # - id: openai-luna
  #   kind: openrouter
  #   model: openai/gpt-5.6-luna
  # - id: openai-terra
  #   kind: openrouter
  #   model: openai/gpt-5.6-terra
  # - id: openai-sol
  #   kind: openrouter
  #   model: openai/gpt-5.6-sol
  # Structured-output-capable Anthropic tiers (catalog checked 2026-09-20).
  # - id: anthropic-haiku
  #   kind: openrouter
  #   model: anthropic/claude-haiku-4.5
  # - id: anthropic-sonnet
  #   kind: openrouter
  #   model: anthropic/claude-sonnet-4.6
  # - id: anthropic-opus
  #   kind: openrouter
  #   model: anthropic/claude-opus-4.6
execution:
  concurrency: 4
  retries: 2
  timeout_seconds: 30